<a href="https://colab.research.google.com/github/MikeDeecode/Campus-placement-project/blob/master/school_placement.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt
import seaborn as sns 
import warnings 
warnings.filterwarnings('ignore')
%matplotlib inline

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [2]:
pment = pd.read_csv("/content/Placement_Data_(viz).csv", index_col = 0)
print ("Successful")

Successful

In [3]:
pment.head()

      gender  ssc_p    ssc_b  hsc_p  ... specialisation  mba_p      status    salary
sl_no                                ...
1          M  67.00   Others  91.00  ...         Mkt&HR  58.80      Placed  270000.0
2          M  79.33  Central  78.33  ...        Mkt&Fin  66.28      Placed  200000.0
3          M  65.00  Central  68.00  ...        Mkt&Fin  57.80      Placed  250000.0
4          M  56.00  Central  52.00  ...         Mkt&HR  59.43  Not Placed       NaN
5          M  85.80  Central  73.60  ...        Mkt&Fin  55.50      Placed  425000.0

[5 rows x 14 columns]

In [4]:
pment.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 215 entries, 1 to 215
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   gender          215 non-null    object
 1   ssc_p           215 non-null    float64
 2   ssc_b           215 non-null    object
 3   hsc_p           215 non-null    float64
 4   hsc_b           215 non-null    object
 5   hsc_s           215 non-null    object
 6   degree_p        215 non-null    float64
 7   degree_t        215 non-null    object
 8   workex          215 non-null    object
 9   etest_p         215 non-null    float64
 10  specialisation  215 non-null    object
 11  mba_p           215 non-null    float64
 12  status          215 non-null    object
 13  salary          148 non-null    float64
dtypes: float64(6), object(8)
memory usage: 25.2+ KB

In [0]:
pment['salary'] = pment['salary'].fillna(0)

In [6]:
pment.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 215 entries, 1 to 215
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   gender          215 non-null    object
 1   ssc_p           215 non-null    float64
 2   ssc_b           215 non-null    object
 3   hsc_p           215 non-null    float64
 4   hsc_b           215 non-null    object
 5   hsc_s           215 non-null    object
 6   degree_p        215 non-null    float64
 7   degree_t        215 non-null    object
 8   workex          215 non-null    object
 9   etest_p         215 non-null    float64
 10  specialisation  215 non-null    object
 11  mba_p           215 non-null    float64
 12  status          215 non-null    object
 13  salary          215 non-null    float64
dtypes: float64(6), object(8)
memory usage: 25.2+ KB

In [0]:
def print_unique(field_v):
  result = print (field_v.unique())
  return result

In [8]:
print_unique(pment['ssc_b'])
print_unique(pment['hsc_s'])
print_unique(pment['degree_t'])
print_unique(pment['gender'])
print_unique(pment['status'])
print_unique(pment['workex'])

['Others' 'Central']
['Commerce' 'Science' 'Arts']
['Sci&Tech' 'Comm&Mgmt' 'Others']
['M' 'F']
['Placed' 'Not Placed']
['No' 'Yes']

In [0]:
pment['ssc_b'] = pment['ssc_b'].astype("category")
pment['hsc_s'] = pment['hsc_s'].astype("category")
pment['degree_t'] = pment['degree_t'].astype("category")
pment['gender'] = pment['gender'].astype("category")
pment['status'] = pment['status'].astype("category")
pment['workex'] = pment['workex'].astype("category")
pment['salary'] = pment['salary'].astype('int')

In [10]:
pment.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 215 entries, 1 to 215
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   gender          215 non-null    category
 1   ssc_p           215 non-null    float64
 2   ssc_b           215 non-null    category
 3   hsc_p           215 non-null    float64
 4   hsc_b           215 non-null    object
 5   hsc_s           215 non-null    category
 6   degree_p        215 non-null    float64
 7   degree_t        215 non-null    category
 8   workex          215 non-null    category
 9   etest_p         215 non-null    float64
 10  specialisation  215 non-null    object
 11  mba_p           215 non-null    float64
 12  status          215 non-null    category
 13  salary          215 non-null    int64
dtypes: category(6), float64(5), int64(1), object(2)
memory usage: 17.0+ KB

In [11]:
pment.head()

      gender  ssc_p    ssc_b  hsc_p  ... specialisation  mba_p      status  salary
sl_no                                ...
1          M  67.00   Others  91.00  ...         Mkt&HR  58.80      Placed  270000
2          M  79.33  Central  78.33  ...        Mkt&Fin  66.28      Placed  200000
3          M  65.00  Central  68.00  ...        Mkt&Fin  57.80      Placed  250000
4          M  56.00  Central  52.00  ...         Mkt&HR  59.43  Not Placed       0
5          M  85.80  Central  73.60  ...        Mkt&Fin  55.50      Placed  425000

[5 rows x 14 columns]

In [12]:
pment.shape

(215, 14)

In [13]:
pment.describe()

            ssc_p       hsc_p  ...       mba_p         salary
count  215.000000  215.000000  ...  215.000000     215.000000
mean    67.303395   66.333163  ...   62.278186  198702.325581
std     10.827205   10.897509  ...    5.833385  154780.926716
min     40.890000   37.000000  ...   51.210000       0.000000
25%     60.600000   60.900000  ...   57.945000       0.000000
50%     67.000000   65.000000  ...   62.000000  240000.000000
75%     75.700000   73.000000  ...   66.255000  282500.000000
max     89.400000   97.700000  ...   77.890000  940000.000000

[8 rows x 6 columns]

In [14]:
pment.describe(include ='all')

       gender       ssc_p    ssc_b  ...       mba_p  status         salary
count     215  215.000000      215  ...  215.000000     215     215.000000
unique      2         NaN        2  ...         NaN       2            NaN
top         M         NaN  Central  ...         NaN  Placed            NaN
freq      139         NaN      116  ...         NaN     148            NaN
mean      NaN   67.303395      NaN  ...   62.278186     NaN  198702.325581
std       NaN   10.827205      NaN  ...    5.833385     NaN  154780.926716
min       NaN   40.890000      NaN  ...   51.210000     NaN       0.000000
25%       NaN   60.600000      NaN  ...   57.945000     NaN       0.000000
50%       NaN   67.000000      NaN  ...   62.000000     NaN  240000.000000
75%       NaN   75.700000      NaN  ...   66.255000     NaN  282500.000000
max       NaN   89.400000      NaN  ...   77.890000     NaN  940000.000000

[11 rows x 14 columns]